OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1619.h
#define _PID1SET8               0x01
#define _SET8                   0x01
#define _PID1SET9               0x02
#define _SET9                   0x02
#define _PID1SET10              0x04
#define _SET10                  0x04
#define _PID1SET11              0x08
#define _SET11                  0x08
#define _PID1SET12              0x10
#define _SET12                  0x10
#define _PID1SET13              0x20
#define _SET13                  0x20
#define _PID1SET14              0x40
#define _SET14                  0x40
#define _PID1SET15              0x80
#define _SET15                  0x80

//==============================================================================

extern __at(0x058E) __sfr PID1IN;

//==============================================================================
//        PID1INL Bits

extern __at(0x058E) __sfr PID1INL;

typedef union
  {
  struct
    {
    unsigned PID1IN0            : 1;
    unsigned PID1IN1            : 1;
    unsigned PID1IN2            : 1;
    unsigned PID1IN3            : 1;
    unsigned PID1IN4            : 1;
    unsigned PID1IN5            : 1;
    unsigned PID1IN6            : 1;
    unsigned PID1IN7            : 1;
    };

  struct
    {
    unsigned IN0                : 1;
    unsigned IN1                : 1;
    unsigned IN2                : 1;
    unsigned IN3                : 1;
    unsigned IN4                : 1;
    unsigned IN5                : 1;
    unsigned IN6                : 1;
    unsigned IN7                : 1;
    };
  } __PID1INLbits_t;

extern __at(0x058E) volatile __PID1INLbits_t PID1INLbits;

#define _PID1IN0                0x01
#define _IN0                    0x01
#define _PID1IN1                0x02
#define _IN1                    0x02
#define _PID1IN2                0x04
#define _IN2                    0x04
#define _PID1IN3                0x08
#define _IN3                    0x08
#define _PID1IN4                0x10
#define _IN4                    0x10
#define _PID1IN5                0x20
#define _IN5                    0x20
#define _PID1IN6                0x40
#define _IN6                    0x40
#define _PID1IN7                0x80
#define _IN7                    0x80

//==============================================================================


//==============================================================================
//        PID1INH Bits

extern __at(0x058F) __sfr PID1INH;

typedef union
  {
  struct
    {
    unsigned PID1IN8            : 1;
    unsigned PID1IN9            : 1;
    unsigned PID1IN10           : 1;
    unsigned PID1IN11           : 1;
    unsigned PID1IN12           : 1;
    unsigned PID1IN13           : 1;
    unsigned PID1IN14           : 1;
    unsigned PID1IN15           : 1;
    };

  struct
    {
    unsigned IN8                : 1;
    unsigned IN9                : 1;
    unsigned IN10               : 1;
    unsigned IN11               : 1;
    unsigned IN12               : 1;
    unsigned IN13               : 1;
    unsigned IN14               : 1;
    unsigned IN15               : 1;
    };
  } __PID1INHbits_t;

extern __at(0x058F) volatile __PID1INHbits_t PID1INHbits;

#define _PID1IN8                0x01
#define _IN8                    0x01
#define _PID1IN9                0x02
#define _IN9                    0x02
#define _PID1IN10               0x04
#define _IN10                   0x04
#define _PID1IN11               0x08
#define _IN11                   0x08
#define _PID1IN12               0x10
#define _IN12                   0x10
#define _PID1IN13               0x20
#define _IN13                   0x20
#define _PID1IN14               0x40
#define _IN14                   0x40
#define _PID1IN15               0x80
#define _IN15                   0x80

//==============================================================================

extern __at(0x0590) __sfr PID1K1;

//==============================================================================
//        PID1K1L Bits

extern __at(0x0590) __sfr PID1K1L;

typedef union
  {
  struct
    {
    unsigned PID1K10            : 1;
    unsigned PID1K11            : 1;
    unsigned PID1K12            : 1;
    unsigned PID1K13            : 1;
    unsigned PID1K14            : 1;
    unsigned PID1K15            : 1;
    unsigned PID1K16            : 1;
    unsigned PID1K17            : 1;
    };

  struct
    {
    unsigned K10                : 1;
    unsigned K11                : 1;
    unsigned K12                : 1;
    unsigned K13                : 1;
    unsigned K14                : 1;
    unsigned K15                : 1;
    unsigned K16                : 1;
    unsigned K17                : 1;
    };
  } __PID1K1Lbits_t;

extern __at(0x0590) volatile __PID1K1Lbits_t PID1K1Lbits;

#define _PID1K10                0x01
#define _K10                    0x01
#define _PID1K11                0x02
#define _K11                    0x02
#define _PID1K12                0x04
#define _K12                    0x04
#define _PID1K13                0x08
#define _K13                    0x08
#define _PID1K14                0x10
#define _K14                    0x10
#define _PID1K15                0x20
#define _K15                    0x20
#define _PID1K16                0x40
#define _K16                    0x40
#define _PID1K17                0x80
#define _K17                    0x80

//==============================================================================


//==============================================================================
//        PID1K1H Bits

extern __at(0x0591) __sfr PID1K1H;

typedef union
  {
  struct
    {
    unsigned PID1K18            : 1;
    unsigned PID1K19            : 1;
    unsigned PID1K110           : 1;
    unsigned PID1K111           : 1;
    unsigned PID1K112           : 1;
    unsigned PID1K113           : 1;
    unsigned PID1K114           : 1;
    unsigned PID1K115           : 1;
    };

  struct
    {
    unsigned K18                : 1;
    unsigned K19                : 1;
    unsigned K110               : 1;
    unsigned K111               : 1;
    unsigned K112               : 1;
    unsigned K113               : 1;
    unsigned K114               : 1;
    unsigned K115               : 1;
    };
  } __PID1K1Hbits_t;

extern __at(0x0591) volatile __PID1K1Hbits_t PID1K1Hbits;

