OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1619.h
#define _PID1K38                0x01
#define _K38                    0x01
#define _PID1K39                0x02
#define _K39                    0x02
#define _PID1K310               0x04
#define _K310                   0x04
#define _PID1K311               0x08
#define _K311                   0x08
#define _PID1K312               0x10
#define _K312                   0x10
#define _PID1K313               0x20
#define _K313                   0x20
#define _PID1K314               0x40
#define _K314                   0x40
#define _PID1K315               0x80
#define _K315                   0x80

//==============================================================================

extern __at(0x0596) __sfr PID1OUT;

//==============================================================================
//        PID1OUTLL Bits

extern __at(0x0596) __sfr PID1OUTLL;

typedef union
  {
  struct
    {
    unsigned PID1OUT0           : 1;
    unsigned PID1OUT1           : 1;
    unsigned PID1OUT2           : 1;
    unsigned PID1OUT3           : 1;
    unsigned PID1OUT4           : 1;
    unsigned PID1OUT5           : 1;
    unsigned PID1OUT6           : 1;
    unsigned PID1OUT7           : 1;
    };

  struct
    {
    unsigned OUT0               : 1;
    unsigned OUT1               : 1;
    unsigned OUT2               : 1;
    unsigned OUT3               : 1;
    unsigned OUT4               : 1;
    unsigned OUT5               : 1;
    unsigned OUT6               : 1;
    unsigned OUT7               : 1;
    };
  } __PID1OUTLLbits_t;

extern __at(0x0596) volatile __PID1OUTLLbits_t PID1OUTLLbits;

#define _PID1OUT0               0x01
#define _OUT0                   0x01
#define _PID1OUT1               0x02
#define _OUT1                   0x02
#define _PID1OUT2               0x04
#define _OUT2                   0x04
#define _PID1OUT3               0x08
#define _OUT3                   0x08
#define _PID1OUT4               0x10
#define _OUT4                   0x10
#define _PID1OUT5               0x20
#define _OUT5                   0x20
#define _PID1OUT6               0x40
#define _OUT6                   0x40
#define _PID1OUT7               0x80
#define _OUT7                   0x80

//==============================================================================


//==============================================================================
//        PID1OUTLH Bits

extern __at(0x0597) __sfr PID1OUTLH;

typedef union
  {
  struct
    {
    unsigned PID1OUT8           : 1;
    unsigned PID1OUT9           : 1;
    unsigned PID1OUT10          : 1;
    unsigned PID1OUT11          : 1;
    unsigned PID1OUT12          : 1;
    unsigned PID1OUT13          : 1;
    unsigned PID1OUT14          : 1;
    unsigned PID1OUT15          : 1;
    };

  struct
    {
    unsigned OUT8               : 1;
    unsigned OUT9               : 1;
    unsigned OUT10              : 1;
    unsigned OUT11              : 1;
    unsigned OUT12              : 1;
    unsigned OUT13              : 1;
    unsigned OUT14              : 1;
    unsigned OUT15              : 1;
    };
  } __PID1OUTLHbits_t;

extern __at(0x0597) volatile __PID1OUTLHbits_t PID1OUTLHbits;

#define _PID1OUT8               0x01
#define _OUT8                   0x01
#define _PID1OUT9               0x02
#define _OUT9                   0x02
#define _PID1OUT10              0x04
#define _OUT10                  0x04
#define _PID1OUT11              0x08
#define _OUT11                  0x08
#define _PID1OUT12              0x10
#define _OUT12                  0x10
#define _PID1OUT13              0x20
#define _OUT13                  0x20
#define _PID1OUT14              0x40
#define _OUT14                  0x40
#define _PID1OUT15              0x80
#define _OUT15                  0x80

//==============================================================================


//==============================================================================
//        PID1OUTHL Bits

extern __at(0x0598) __sfr PID1OUTHL;

typedef union
  {
  struct
    {
    unsigned PID1OUT16          : 1;
    unsigned PID1OUT17          : 1;
    unsigned PID1OUT18          : 1;
    unsigned PID1OUT19          : 1;
    unsigned PID1OUT20          : 1;
    unsigned PID1OUT21          : 1;
    unsigned PID1OUT22          : 1;
    unsigned PID1OUT23          : 1;
    };

  struct
    {
    unsigned OUT16              : 1;
    unsigned OUT17              : 1;
    unsigned OUT18              : 1;
    unsigned OUT19              : 1;
    unsigned OUT20              : 1;
    unsigned OUT21              : 1;
    unsigned OUT22              : 1;
    unsigned OUT23              : 1;
    };
  } __PID1OUTHLbits_t;

extern __at(0x0598) volatile __PID1OUTHLbits_t PID1OUTHLbits;

#define _PID1OUT16              0x01
#define _OUT16                  0x01
#define _PID1OUT17              0x02
#define _OUT17                  0x02
#define _PID1OUT18              0x04
#define _OUT18                  0x04
#define _PID1OUT19              0x08
#define _OUT19                  0x08
#define _PID1OUT20              0x10
#define _OUT20                  0x10
#define _PID1OUT21              0x20
#define _OUT21                  0x20
#define _PID1OUT22              0x40
#define _OUT22                  0x40
#define _PID1OUT23              0x80
#define _OUT23                  0x80

//==============================================================================


//==============================================================================
//        PID1OUTHH Bits

extern __at(0x0599) __sfr PID1OUTHH;

typedef union
  {
  struct
    {
    unsigned PID1OUT24          : 1;
    unsigned PID1OUT25          : 1;
    unsigned PID1OUT26          : 1;
    unsigned PID1OUT27          : 1;
    unsigned PID1OUT28          : 1;
    unsigned PID1OUT29          : 1;
    unsigned PID1OUT30          : 1;
    unsigned PID1OUT31          : 1;
    };

  struct
    {
    unsigned OUT24              : 1;
    unsigned OUT25              : 1;
    unsigned OUT26              : 1;
    unsigned OUT27              : 1;
    unsigned OUT28              : 1;
    unsigned OUT29              : 1;
    unsigned OUT30              : 1;
    unsigned OUT31              : 1;
    };
  } __PID1OUTHHbits_t;

extern __at(0x0599) volatile __PID1OUTHHbits_t PID1OUTHHbits;

#define _PID1OUT24              0x01
#define _OUT24                  0x01
#define _PID1OUT25              0x02
#define _OUT25                  0x02
#define _PID1OUT26              0x04
#define _OUT26                  0x04
#define _PID1OUT27              0x08
#define _OUT27                  0x08
#define _PID1OUT28              0x10
#define _OUT28                  0x10
#define _PID1OUT29              0x20
#define _OUT29                  0x20
#define _PID1OUT30              0x40
#define _OUT30                  0x40
#define _PID1OUT31              0x80
#define _OUT31                  0x80

//==============================================================================


//==============================================================================
//        PID1OUTU Bits

extern __at(0x059A) __sfr PID1OUTU;

typedef union
  {
  struct
    {
    unsigned PID1OUT32          : 1;
    unsigned PID1OUT33          : 1;
    unsigned PID1OUT34          : 1;
    unsigned PID1OUT35          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned OUT32              : 1;
    unsigned OUT33              : 1;
    unsigned OUT34              : 1;
    unsigned OUT35              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PID1OUTUbits_t;

extern __at(0x059A) volatile __PID1OUTUbits_t PID1OUTUbits;

#define _PID1OUT32              0x01
#define _OUT32                  0x01
#define _PID1OUT33              0x02
#define _OUT33                  0x02
#define _PID1OUT34              0x04
#define _OUT34                  0x04
#define _PID1OUT35              0x08
#define _OUT35                  0x08

//==============================================================================

extern __at(0x059B) __sfr PID1Z1;

//==============================================================================
//        PID1Z1L Bits

extern __at(0x059B) __sfr PID1Z1L;

typedef union
  {
  struct
    {
    unsigned PID1Z10            : 1;
    unsigned PID1Z11            : 1;
    unsigned PID1Z12            : 1;
    unsigned PID1Z13            : 1;
    unsigned PID1Z14            : 1;
    unsigned PID1Z15            : 1;
    unsigned PID1Z16            : 1;
    unsigned PID1Z17            : 1;
    };

  struct
    {
    unsigned Z10                : 1;
    unsigned Z11                : 1;
    unsigned Z12                : 1;
    unsigned Z13                : 1;
    unsigned Z14                : 1;
    unsigned Z15                : 1;
    unsigned Z16                : 1;
    unsigned Z17                : 1;
    };
  } __PID1Z1Lbits_t;

extern __at(0x059B) volatile __PID1Z1Lbits_t PID1Z1Lbits;

#define _PID1Z10                0x01
#define _Z10                    0x01
#define _PID1Z11                0x02
#define _Z11                    0x02
#define _PID1Z12                0x04
#define _Z12                    0x04
#define _PID1Z13                0x08
#define _Z13                    0x08
#define _PID1Z14                0x10
#define _Z14                    0x10
#define _PID1Z15                0x20
#define _Z15                    0x20
#define _PID1Z16                0x40
#define _Z16                    0x40
#define _PID1Z17                0x80
#define _Z17                    0x80

//==============================================================================


//==============================================================================
//        PID1Z1H Bits

extern __at(0x059C) __sfr PID1Z1H;

typedef union
  {
  struct
    {
    unsigned PID1Z18            : 1;
    unsigned PID1Z19            : 1;
    unsigned PID1Z110           : 1;
    unsigned PID1Z111           : 1;
    unsigned PID1Z112           : 1;
    unsigned PID1Z113           : 1;
    unsigned PID1Z114           : 1;
    unsigned PID1Z115           : 1;
    };

  struct
    {
    unsigned Z18                : 1;
    unsigned Z19                : 1;
    unsigned Z110               : 1;
    unsigned Z111               : 1;
    unsigned Z112               : 1;
    unsigned Z113               : 1;
    unsigned Z114               : 1;
    unsigned Z115               : 1;
    };
  } __PID1Z1Hbits_t;

extern __at(0x059C) volatile __PID1Z1Hbits_t PID1Z1Hbits;

