OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1619.h
#define _PID1Z18                0x01
#define _Z18                    0x01
#define _PID1Z19                0x02
#define _Z19                    0x02
#define _PID1Z110               0x04
#define _Z110                   0x04
#define _PID1Z111               0x08
#define _Z111                   0x08
#define _PID1Z112               0x10
#define _Z112                   0x10
#define _PID1Z113               0x20
#define _Z113                   0x20
#define _PID1Z114               0x40
#define _Z114                   0x40
#define _PID1Z115               0x80
#define _Z115                   0x80

//==============================================================================


//==============================================================================
//        PID1Z1U Bits

extern __at(0x059D) __sfr PID1Z1U;

typedef union
  {
  struct
    {
    unsigned PID1Z116           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned Z116               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PID1Z1Ubits_t;

extern __at(0x059D) volatile __PID1Z1Ubits_t PID1Z1Ubits;

#define _PID1Z116               0x01
#define _Z116                   0x01

//==============================================================================

extern __at(0x060C) __sfr PID1Z2;

//==============================================================================
//        PID1Z2L Bits

extern __at(0x060C) __sfr PID1Z2L;

typedef union
  {
  struct
    {
    unsigned PID1Z20            : 1;
    unsigned PID1Z21            : 1;
    unsigned PID1Z22            : 1;
    unsigned PID1Z23            : 1;
    unsigned PID1Z24            : 1;
    unsigned PID1Z25            : 1;
    unsigned PID1Z26            : 1;
    unsigned PID1Z27            : 1;
    };

  struct
    {
    unsigned Z20                : 1;
    unsigned Z21                : 1;
    unsigned Z22                : 1;
    unsigned Z23                : 1;
    unsigned Z24                : 1;
    unsigned Z25                : 1;
    unsigned Z26                : 1;
    unsigned Z27                : 1;
    };
  } __PID1Z2Lbits_t;

extern __at(0x060C) volatile __PID1Z2Lbits_t PID1Z2Lbits;

#define _PID1Z20                0x01
#define _Z20                    0x01
#define _PID1Z21                0x02
#define _Z21                    0x02
#define _PID1Z22                0x04
#define _Z22                    0x04
#define _PID1Z23                0x08
#define _Z23                    0x08
#define _PID1Z24                0x10
#define _Z24                    0x10
#define _PID1Z25                0x20
#define _Z25                    0x20
#define _PID1Z26                0x40
#define _Z26                    0x40
#define _PID1Z27                0x80
#define _Z27                    0x80

//==============================================================================


//==============================================================================
//        PID1Z2H Bits

extern __at(0x060D) __sfr PID1Z2H;

typedef union
  {
  struct
    {
    unsigned PID1Z28            : 1;
    unsigned PID1Z29            : 1;
    unsigned PID1Z210           : 1;
    unsigned PID1Z211           : 1;
    unsigned PID1Z212           : 1;
    unsigned PID1Z213           : 1;
    unsigned PID1Z214           : 1;
    unsigned PID1Z215           : 1;
    };

  struct
    {
    unsigned Z28                : 1;
    unsigned Z29                : 1;
    unsigned Z210               : 1;
    unsigned Z211               : 1;
    unsigned Z212               : 1;
    unsigned Z213               : 1;
    unsigned Z214               : 1;
    unsigned Z215               : 1;
    };
  } __PID1Z2Hbits_t;

extern __at(0x060D) volatile __PID1Z2Hbits_t PID1Z2Hbits;

#define _PID1Z28                0x01
#define _Z28                    0x01
#define _PID1Z29                0x02
#define _Z29                    0x02
#define _PID1Z210               0x04
#define _Z210                   0x04
#define _PID1Z211               0x08
#define _Z211                   0x08
#define _PID1Z212               0x10
#define _Z212                   0x10
#define _PID1Z213               0x20
#define _Z213                   0x20
#define _PID1Z214               0x40
#define _Z214                   0x40
#define _PID1Z215               0x80
#define _Z215                   0x80

//==============================================================================


//==============================================================================
//        PID1Z2U Bits

extern __at(0x060E) __sfr PID1Z2U;

typedef union
  {
  struct
    {
    unsigned PID1Z216           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned Z216               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PID1Z2Ubits_t;

extern __at(0x060E) volatile __PID1Z2Ubits_t PID1Z2Ubits;

#define _PID1Z216               0x01
#define _Z216                   0x01

//==============================================================================

extern __at(0x060F) __sfr PID1ACC;

//==============================================================================
//        PID1ACCLL Bits

