OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1619.h
#define _PLEN0                  0x01
#define _CRCPLEN0               0x01
#define _PLEN1                  0x02
#define _CRCPLEN1               0x02
#define _PLEN2                  0x04
#define _CRCPLEN2               0x04
#define _PLEN3                  0x08
#define _CRCPLEN3               0x08
#define _DLEN0                  0x10
#define _CRCDLEN0               0x10
#define _DLEN1                  0x20
#define _CRCDLEN1               0x20
#define _DLEN2                  0x40
#define _CRCDLEN2               0x40
#define _DLEN3                  0x80
#define _CRCDLEN3               0x80

//==============================================================================

extern __at(0x080C) __sfr AT1RES;

//==============================================================================
//        AT1RESL Bits

extern __at(0x080C) __sfr AT1RESL;

typedef union
  {
  struct
    {
    unsigned AT1RES0            : 1;
    unsigned AT1RES1            : 1;
    unsigned AT1RES2            : 1;
    unsigned AT1RES3            : 1;
    unsigned AT1RES4            : 1;
    unsigned AT1RES5            : 1;
    unsigned AT1RES6            : 1;
    unsigned AT1RES7            : 1;
    };

  struct
    {
    unsigned RES0               : 1;
    unsigned RES1               : 1;
    unsigned RES2               : 1;
    unsigned RES3               : 1;
    unsigned RES4               : 1;
    unsigned RES5               : 1;
    unsigned RES6               : 1;
    unsigned RES7               : 1;
    };
  } __AT1RESLbits_t;

extern __at(0x080C) volatile __AT1RESLbits_t AT1RESLbits;

#define _AT1RES0                0x01
#define _RES0                   0x01
#define _AT1RES1                0x02
#define _RES1                   0x02
#define _AT1RES2                0x04
#define _RES2                   0x04
#define _AT1RES3                0x08
#define _RES3                   0x08
#define _AT1RES4                0x10
#define _RES4                   0x10
#define _AT1RES5                0x20
#define _RES5                   0x20
#define _AT1RES6                0x40
#define _RES6                   0x40
#define _AT1RES7                0x80
#define _RES7                   0x80

//==============================================================================


//==============================================================================
//        AT1RESH Bits

extern __at(0x080D) __sfr AT1RESH;

typedef union
  {
  struct
    {
    unsigned AT1RES8            : 1;
    unsigned AT1RES9            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RES8               : 1;
    unsigned RES9               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __AT1RESHbits_t;

extern __at(0x080D) volatile __AT1RESHbits_t AT1RESHbits;

#define _AT1RES8                0x01
#define _RES8                   0x01
#define _AT1RES9                0x02
#define _RES9                   0x02

//==============================================================================

extern __at(0x080E) __sfr AT1MISS;

//==============================================================================
//        AT1MISSL Bits

extern __at(0x080E) __sfr AT1MISSL;

typedef union
  {
  struct
    {
    unsigned AT1MISS0           : 1;
    unsigned AT1MISS1           : 1;
    unsigned AT1MISS2           : 1;
    unsigned AT1MISS3           : 1;
    unsigned AT1MISS4           : 1;
    unsigned AT1MISS5           : 1;
    unsigned AT1MISS6           : 1;
    unsigned AT1MISS7           : 1;
    };

  struct
    {
    unsigned MISS0              : 1;
    unsigned MISS1              : 1;
    unsigned MISS2              : 1;
    unsigned MISS3              : 1;
    unsigned MISS4              : 1;
    unsigned MISS5              : 1;
    unsigned MISS6              : 1;
    unsigned MISS7              : 1;
    };
  } __AT1MISSLbits_t;

extern __at(0x080E) volatile __AT1MISSLbits_t AT1MISSLbits;

#define _AT1MISS0               0x01
#define _MISS0                  0x01
#define _AT1MISS1               0x02
#define _MISS1                  0x02
#define _AT1MISS2               0x04
#define _MISS2                  0x04
#define _AT1MISS3               0x08
#define _MISS3                  0x08
#define _AT1MISS4               0x10
#define _MISS4                  0x10
#define _AT1MISS5               0x20
#define _MISS5                  0x20
#define _AT1MISS6               0x40
#define _MISS6                  0x40
#define _AT1MISS7               0x80
#define _MISS7                  0x80

//==============================================================================


//==============================================================================
//        AT1MISSH Bits

extern __at(0x080F) __sfr AT1MISSH;

typedef union
  {
  struct
    {
    unsigned AT1MISS8           : 1;
    unsigned AT1MISS9           : 1;
    unsigned AT1MISS10          : 1;
    unsigned AT1MISS11          : 1;
    unsigned AT1MISS12          : 1;
    unsigned AT1MISS13          : 1;
    unsigned AT1MISS14          : 1;
    unsigned AT1MISS15          : 1;
    };

  struct
    {
    unsigned MISS8              : 1;
    unsigned MISS9              : 1;
    unsigned MISS10             : 1;
    unsigned MISS11             : 1;
    unsigned MISS12             : 1;
    unsigned MISS13             : 1;
    unsigned MISS14             : 1;
    unsigned MISS15             : 1;
    };
  } __AT1MISSHbits_t;

extern __at(0x080F) volatile __AT1MISSHbits_t AT1MISSHbits;

#define _AT1MISS8               0x01
#define _MISS8                  0x01
#define _AT1MISS9               0x02
#define _MISS9                  0x02
#define _AT1MISS10              0x04
#define _MISS10                 0x04
#define _AT1MISS11              0x08
#define _MISS11                 0x08
#define _AT1MISS12              0x10
#define _MISS12                 0x10
#define _AT1MISS13              0x20
#define _MISS13                 0x20
#define _AT1MISS14              0x40
#define _MISS14                 0x40
#define _AT1MISS15              0x80
#define _MISS15                 0x80

//==============================================================================

extern __at(0x0810) __sfr AT1PER;

//==============================================================================
//        AT1PERL Bits

extern __at(0x0810) __sfr AT1PERL;

typedef union
  {
  struct
    {
    unsigned AT1PER0            : 1;
    unsigned AT1PER1            : 1;
    unsigned AT1PER2            : 1;
    unsigned AT1PER3            : 1;
    unsigned AT1PER4            : 1;
    unsigned AT1PER5            : 1;
    unsigned AT1PER6            : 1;
    unsigned AT1PER7            : 1;
    };

  struct
    {
    unsigned PER0               : 1;
    unsigned PER1               : 1;
    unsigned PER2               : 1;
    unsigned PER3               : 1;
    unsigned PER4               : 1;
    unsigned PER5               : 1;
    unsigned PER6               : 1;
    unsigned PER7               : 1;
    };

  struct
    {
    unsigned PERL0              : 1;
    unsigned PERL1              : 1;
    unsigned PERL2              : 1;
    unsigned PERL3              : 1;
    unsigned PERL4              : 1;
    unsigned PERL5              : 1;
    unsigned PERL6              : 1;
    unsigned PERL7              : 1;
    };
  } __AT1PERLbits_t;

extern __at(0x0810) volatile __AT1PERLbits_t AT1PERLbits;

#define _AT1PER0                0x01
#define _PER0                   0x01
#define _PERL0                  0x01
#define _AT1PER1                0x02
#define _PER1                   0x02
#define _PERL1                  0x02
#define _AT1PER2                0x04
#define _PER2                   0x04
#define _PERL2                  0x04
#define _AT1PER3                0x08
#define _PER3                   0x08
#define _PERL3                  0x08
#define _AT1PER4                0x10
#define _PER4                   0x10
#define _PERL4                  0x10
#define _AT1PER5                0x20
#define _PER5                   0x20
#define _PERL5                  0x20
#define _AT1PER6                0x40
#define _PER6                   0x40
#define _PERL6                  0x40
#define _AT1PER7                0x80
#define _PER7                   0x80
#define _PERL7                  0x80

//==============================================================================


//==============================================================================
//        AT1PERH Bits

extern __at(0x0811) __sfr AT1PERH;

typedef union
  {
  struct
    {
    unsigned AT1PER8            : 1;
    unsigned AT1PER9            : 1;
    unsigned AT1PER10           : 1;
    unsigned AT1PER11           : 1;
    unsigned AT1PER12           : 1;
    unsigned AT1PER13           : 1;
    unsigned AT1PER14           : 1;
    unsigned AT1POV             : 1;
    };

  struct
    {
    unsigned PER8               : 1;
    unsigned PER9               : 1;
    unsigned PER10              : 1;
    unsigned PER11              : 1;
    unsigned PER12              : 1;
    unsigned PER13              : 1;
    unsigned PER14              : 1;
    unsigned PER15              : 1;
    };

  struct
    {
    unsigned PERH0              : 1;
    unsigned PERH1              : 1;
    unsigned PERH2              : 1;
    unsigned PERH3              : 1;
    unsigned PERH4              : 1;
    unsigned PERH5              : 1;
    unsigned PERH6              : 1;
    unsigned PERH7              : 1;
    };
  } __AT1PERHbits_t;

extern __at(0x0811) volatile __AT1PERHbits_t AT1PERHbits;

#define _AT1PER8                0x01
#define _PER8                   0x01
#define _PERH0                  0x01
#define _AT1PER9                0x02
#define _PER9                   0x02
#define _PERH1                  0x02
#define _AT1PER10               0x04
#define _PER10                  0x04
#define _PERH2                  0x04
#define _AT1PER11               0x08
#define _PER11                  0x08
#define _PERH3                  0x08
#define _AT1PER12               0x10
#define _PER12                  0x10
#define _PERH4                  0x10
#define _AT1PER13               0x20
#define _PER13                  0x20
#define _PERH5                  0x20
#define _AT1PER14               0x40
#define _PER14                  0x40
#define _PERH6                  0x40
#define _AT1POV                 0x80
#define _PER15                  0x80
#define _PERH7                  0x80

//==============================================================================

extern __at(0x0812) __sfr AT1PHS;

//==============================================================================
//        AT1PHSL Bits

