OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1619.h
#define AT1CC28                 AT1CC2Hbits.AT1CC28             // bit 0, shadows bit in AT1CC2Hbits
#define CC28                    AT1CC2Hbits.CC28                // bit 0, shadows bit in AT1CC2Hbits
#define AT1CC29                 AT1CC2Hbits.AT1CC29             // bit 1, shadows bit in AT1CC2Hbits
#define CC29                    AT1CC2Hbits.CC29                // bit 1, shadows bit in AT1CC2Hbits

#define AT1CC38                 AT1CC3Hbits.AT1CC38             // bit 0, shadows bit in AT1CC3Hbits
#define CC38                    AT1CC3Hbits.CC38                // bit 0, shadows bit in AT1CC3Hbits
#define AT1CC39                 AT1CC3Hbits.AT1CC39             // bit 1, shadows bit in AT1CC3Hbits
#define CC39                    AT1CC3Hbits.CC39                // bit 1, shadows bit in AT1CC3Hbits

#define AT1CC30                 AT1CC3Lbits.AT1CC30             // bit 0, shadows bit in AT1CC3Lbits
#define CC30                    AT1CC3Lbits.CC30                // bit 0, shadows bit in AT1CC3Lbits
#define AT1CC31                 AT1CC3Lbits.AT1CC31             // bit 1, shadows bit in AT1CC3Lbits
#define CC31                    AT1CC3Lbits.CC31                // bit 1, shadows bit in AT1CC3Lbits
#define AT1CC32                 AT1CC3Lbits.AT1CC32             // bit 2, shadows bit in AT1CC3Lbits
#define CC32                    AT1CC3Lbits.CC32                // bit 2, shadows bit in AT1CC3Lbits
#define AT1CC33                 AT1CC3Lbits.AT1CC33             // bit 3, shadows bit in AT1CC3Lbits
#define CC33                    AT1CC3Lbits.CC33                // bit 3, shadows bit in AT1CC3Lbits
#define AT1CC34                 AT1CC3Lbits.AT1CC34             // bit 4, shadows bit in AT1CC3Lbits
#define CC34                    AT1CC3Lbits.CC34                // bit 4, shadows bit in AT1CC3Lbits
#define AT1CC35                 AT1CC3Lbits.AT1CC35             // bit 5, shadows bit in AT1CC3Lbits
#define CC35                    AT1CC3Lbits.CC35                // bit 5, shadows bit in AT1CC3Lbits
#define AT1CC36                 AT1CC3Lbits.AT1CC36             // bit 6, shadows bit in AT1CC3Lbits
#define CC36                    AT1CC3Lbits.CC36                // bit 6, shadows bit in AT1CC3Lbits
#define AT1CC37                 AT1CC3Lbits.AT1CC37             // bit 7, shadows bit in AT1CC3Lbits
#define CC37                    AT1CC3Lbits.CC37                // bit 7, shadows bit in AT1CC3Lbits

#define AT1CC1MODE              AT1CCON1bits.AT1CC1MODE         // bit 0, shadows bit in AT1CCON1bits
#define CC1MODE                 AT1CCON1bits.CC1MODE            // bit 0, shadows bit in AT1CCON1bits
#define AT1CAP1P                AT1CCON1bits.AT1CAP1P           // bit 3, shadows bit in AT1CCON1bits
#define CAP1P                   AT1CCON1bits.CAP1P              // bit 3, shadows bit in AT1CCON1bits
#define AT1CC1POL               AT1CCON1bits.AT1CC1POL          // bit 4, shadows bit in AT1CCON1bits
#define CC1POL                  AT1CCON1bits.CC1POL             // bit 4, shadows bit in AT1CCON1bits
#define AT1CC1EN                AT1CCON1bits.AT1CC1EN           // bit 7, shadows bit in AT1CCON1bits
#define CC1EN                   AT1CCON1bits.CC1EN              // bit 7, shadows bit in AT1CCON1bits

#define AT1CC2MODE              AT1CCON2bits.AT1CC2MODE         // bit 0, shadows bit in AT1CCON2bits
#define CC2MODE                 AT1CCON2bits.CC2MODE            // bit 0, shadows bit in AT1CCON2bits
#define AT1CAP2P                AT1CCON2bits.AT1CAP2P           // bit 3, shadows bit in AT1CCON2bits
#define CAP2P                   AT1CCON2bits.CAP2P              // bit 3, shadows bit in AT1CCON2bits
#define AT1CC2POL               AT1CCON2bits.AT1CC2POL          // bit 4, shadows bit in AT1CCON2bits
#define CC2POL                  AT1CCON2bits.CC2POL             // bit 4, shadows bit in AT1CCON2bits
#define AT1CC2EN                AT1CCON2bits.AT1CC2EN           // bit 7, shadows bit in AT1CCON2bits
#define CC2EN                   AT1CCON2bits.CC2EN              // bit 7, shadows bit in AT1CCON2bits

#define AT1CC3MODE              AT1CCON3bits.AT1CC3MODE         // bit 0, shadows bit in AT1CCON3bits
#define CC3MODE                 AT1CCON3bits.CC3MODE            // bit 0, shadows bit in AT1CCON3bits
#define AT1CAP3P                AT1CCON3bits.AT1CAP3P           // bit 3, shadows bit in AT1CCON3bits
#define CAP3P                   AT1CCON3bits.CAP3P              // bit 3, shadows bit in AT1CCON3bits
#define AT1CC3POL               AT1CCON3bits.AT1CC3POL          // bit 4, shadows bit in AT1CCON3bits
#define CC3POL                  AT1CCON3bits.CC3POL             // bit 4, shadows bit in AT1CCON3bits
#define AT1CC3EN                AT1CCON3bits.AT1CC3EN           // bit 7, shadows bit in AT1CCON3bits
#define CC3EN                   AT1CCON3bits.CC3EN              // bit 7, shadows bit in AT1CCON3bits

#define CS                      AT1CLKbits.CS                   // bit 0, shadows bit in AT1CLKbits
#define AT1CS                   AT1CLKbits.AT1CS                // bit 0, shadows bit in AT1CLKbits
#define CS0                     AT1CLKbits.CS0                  // bit 0, shadows bit in AT1CLKbits
#define AT1CS0                  AT1CLKbits.AT1CS0               // bit 0, shadows bit in AT1CLKbits

#define MODE                    AT1CON0bits.MODE                // bit 0, shadows bit in AT1CON0bits
#define AT1MODE                 AT1CON0bits.AT1MODE             // bit 0, shadows bit in AT1CON0bits
#define APMOD                   AT1CON0bits.APMOD               // bit 1, shadows bit in AT1CON0bits
#define AT1APMOD                AT1CON0bits.AT1APMOD            // bit 1, shadows bit in AT1CON0bits
#define POL                     AT1CON0bits.POL                 // bit 3, shadows bit in AT1CON0bits
#define AT1POL                  AT1CON0bits.AT1POL              // bit 3, shadows bit in AT1CON0bits
#define PS0                     AT1CON0bits.PS0                 // bit 4, shadows bit in AT1CON0bits
#define AT1PS0                  AT1CON0bits.AT1PS0              // bit 4, shadows bit in AT1CON0bits
#define PS1                     AT1CON0bits.PS1                 // bit 5, shadows bit in AT1CON0bits
#define AT1PS1                  AT1CON0bits.AT1PS1              // bit 5, shadows bit in AT1CON0bits
#define PREC                    AT1CON0bits.PREC                // bit 6, shadows bit in AT1CON0bits
#define AT1PREC                 AT1CON0bits.AT1PREC             // bit 6, shadows bit in AT1CON0bits
#define EN                      AT1CON0bits.EN                  // bit 7, shadows bit in AT1CON0bits
#define AT1EN                   AT1CON0bits.AT1EN               // bit 7, shadows bit in AT1CON0bits

