OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1619.h
#define AT1PHS8                 AT1PHSHbits.AT1PHS8             // bit 0, shadows bit in AT1PHSHbits
#define PHS8                    AT1PHSHbits.PHS8                // bit 0, shadows bit in AT1PHSHbits
#define PHSL8                   AT1PHSHbits.PHSL8               // bit 0, shadows bit in AT1PHSHbits
#define AT1PHS9                 AT1PHSHbits.AT1PHS9             // bit 1, shadows bit in AT1PHSHbits
#define PHS9                    AT1PHSHbits.PHS9                // bit 1, shadows bit in AT1PHSHbits
#define PHSL9                   AT1PHSHbits.PHSL9               // bit 1, shadows bit in AT1PHSHbits

#define AT1PHS0                 AT1PHSLbits.AT1PHS0             // bit 0, shadows bit in AT1PHSLbits
#define PHS0                    AT1PHSLbits.PHS0                // bit 0, shadows bit in AT1PHSLbits
#define AT1PHS1                 AT1PHSLbits.AT1PHS1             // bit 1, shadows bit in AT1PHSLbits
#define PHS1                    AT1PHSLbits.PHS1                // bit 1, shadows bit in AT1PHSLbits
#define AT1PHS2                 AT1PHSLbits.AT1PHS2             // bit 2, shadows bit in AT1PHSLbits
#define PHS2                    AT1PHSLbits.PHS2                // bit 2, shadows bit in AT1PHSLbits
#define AT1PHS3                 AT1PHSLbits.AT1PHS3             // bit 3, shadows bit in AT1PHSLbits
#define PHS3                    AT1PHSLbits.PHS3                // bit 3, shadows bit in AT1PHSLbits
#define AT1PHS4                 AT1PHSLbits.AT1PHS4             // bit 4, shadows bit in AT1PHSLbits
#define PHS4                    AT1PHSLbits.PHS4                // bit 4, shadows bit in AT1PHSLbits
#define AT1PHS5                 AT1PHSLbits.AT1PHS5             // bit 5, shadows bit in AT1PHSLbits
#define PHS5                    AT1PHSLbits.PHS5                // bit 5, shadows bit in AT1PHSLbits
#define AT1PHS6                 AT1PHSLbits.AT1PHS6             // bit 6, shadows bit in AT1PHSLbits
#define PHS6                    AT1PHSLbits.PHS6                // bit 6, shadows bit in AT1PHSLbits
#define AT1PHS7                 AT1PHSLbits.AT1PHS7             // bit 7, shadows bit in AT1PHSLbits
#define PHS7                    AT1PHSLbits.PHS7                // bit 7, shadows bit in AT1PHSLbits

#define AT1RES8                 AT1RESHbits.AT1RES8             // bit 0, shadows bit in AT1RESHbits
#define RES8                    AT1RESHbits.RES8                // bit 0, shadows bit in AT1RESHbits
#define AT1RES9                 AT1RESHbits.AT1RES9             // bit 1, shadows bit in AT1RESHbits
#define RES9                    AT1RESHbits.RES9                // bit 1, shadows bit in AT1RESHbits

#define AT1RES0                 AT1RESLbits.AT1RES0             // bit 0, shadows bit in AT1RESLbits
#define RES0                    AT1RESLbits.RES0                // bit 0, shadows bit in AT1RESLbits
#define AT1RES1                 AT1RESLbits.AT1RES1             // bit 1, shadows bit in AT1RESLbits
#define RES1                    AT1RESLbits.RES1                // bit 1, shadows bit in AT1RESLbits
#define AT1RES2                 AT1RESLbits.AT1RES2             // bit 2, shadows bit in AT1RESLbits
#define RES2                    AT1RESLbits.RES2                // bit 2, shadows bit in AT1RESLbits
#define AT1RES3                 AT1RESLbits.AT1RES3             // bit 3, shadows bit in AT1RESLbits
#define RES3                    AT1RESLbits.RES3                // bit 3, shadows bit in AT1RESLbits
#define AT1RES4                 AT1RESLbits.AT1RES4             // bit 4, shadows bit in AT1RESLbits
#define RES4                    AT1RESLbits.RES4                // bit 4, shadows bit in AT1RESLbits
#define AT1RES5                 AT1RESLbits.AT1RES5             // bit 5, shadows bit in AT1RESLbits
#define RES5                    AT1RESLbits.RES5                // bit 5, shadows bit in AT1RESLbits
#define AT1RES6                 AT1RESLbits.AT1RES6             // bit 6, shadows bit in AT1RESLbits
#define RES6                    AT1RESLbits.RES6                // bit 6, shadows bit in AT1RESLbits
#define AT1RES7                 AT1RESLbits.AT1RES7             // bit 7, shadows bit in AT1RESLbits
#define RES7                    AT1RESLbits.RES7                // bit 7, shadows bit in AT1RESLbits

#define AT1SSEL0                AT1SIGbits.AT1SSEL0             // bit 0, shadows bit in AT1SIGbits
#define SSEL0                   AT1SIGbits.SSEL0                // bit 0, shadows bit in AT1SIGbits
#define AT1SSEL1                AT1SIGbits.AT1SSEL1             // bit 1, shadows bit in AT1SIGbits
#define SSEL1                   AT1SIGbits.SSEL1                // bit 1, shadows bit in AT1SIGbits
#define AT1SSEL2                AT1SIGbits.AT1SSEL2             // bit 2, shadows bit in AT1SIGbits
#define SSEL2                   AT1SIGbits.SSEL2                // bit 2, shadows bit in AT1SIGbits

#define AT1STPT8                AT1STPTHbits.AT1STPT8           // bit 0, shadows bit in AT1STPTHbits
#define STPT8                   AT1STPTHbits.STPT8              // bit 0, shadows bit in AT1STPTHbits
#define AT1STPT9                AT1STPTHbits.AT1STPT9           // bit 1, shadows bit in AT1STPTHbits
#define STPT9                   AT1STPTHbits.STPT9              // bit 1, shadows bit in AT1STPTHbits
#define AT1STPT10               AT1STPTHbits.AT1STPT10          // bit 2, shadows bit in AT1STPTHbits
#define STPT10                  AT1STPTHbits.STPT10             // bit 2, shadows bit in AT1STPTHbits
#define AT1STPT11               AT1STPTHbits.AT1STPT11          // bit 3, shadows bit in AT1STPTHbits
#define STPT11                  AT1STPTHbits.STPT11             // bit 3, shadows bit in AT1STPTHbits
#define AT1STPT12               AT1STPTHbits.AT1STPT12          // bit 4, shadows bit in AT1STPTHbits
#define STPT12                  AT1STPTHbits.STPT12             // bit 4, shadows bit in AT1STPTHbits
#define AT1STPT13               AT1STPTHbits.AT1STPT13          // bit 5, shadows bit in AT1STPTHbits
#define STPT13                  AT1STPTHbits.STPT13             // bit 5, shadows bit in AT1STPTHbits
#define AT1STPT14               AT1STPTHbits.AT1STPT14          // bit 6, shadows bit in AT1STPTHbits
#define STPT14                  AT1STPTHbits.STPT14             // bit 6, shadows bit in AT1STPTHbits

#define AT1STPT0                AT1STPTLbits.AT1STPT0           // bit 0, shadows bit in AT1STPTLbits
#define STPT0                   AT1STPTLbits.STPT0              // bit 0, shadows bit in AT1STPTLbits
#define AT1STPT1                AT1STPTLbits.AT1STPT1           // bit 1, shadows bit in AT1STPTLbits
#define STPT1                   AT1STPTLbits.STPT1              // bit 1, shadows bit in AT1STPTLbits
#define AT1STPT2                AT1STPTLbits.AT1STPT2           // bit 2, shadows bit in AT1STPTLbits
#define STPT2                   AT1STPTLbits.STPT2              // bit 2, shadows bit in AT1STPTLbits
#define AT1STPT3                AT1STPTLbits.AT1STPT3           // bit 3, shadows bit in AT1STPTLbits
#define STPT3                   AT1STPTLbits.STPT3              // bit 3, shadows bit in AT1STPTLbits
#define AT1STPT4                AT1STPTLbits.AT1STPT4           // bit 4, shadows bit in AT1STPTLbits
#define STPT4                   AT1STPTLbits.STPT4              // bit 4, shadows bit in AT1STPTLbits
#define AT1STPT5                AT1STPTLbits.AT1STPT5           // bit 5, shadows bit in AT1STPTLbits
#define STPT5                   AT1STPTLbits.STPT5              // bit 5, shadows bit in AT1STPTLbits
#define AT1STPT6                AT1STPTLbits.AT1STPT6           // bit 6, shadows bit in AT1STPTLbits
#define STPT6                   AT1STPTLbits.STPT6              // bit 6, shadows bit in AT1STPTLbits
#define AT1STPT7                AT1STPTLbits.AT1STPT7           // bit 7, shadows bit in AT1STPTLbits
#define STPT7                   AT1STPTLbits.STPT7              // bit 7, shadows bit in AT1STPTLbits

#define ATCC1PPS0               ATCC1PPSbits.ATCC1PPS0          // bit 0
#define ATCC1PPS1               ATCC1PPSbits.ATCC1PPS1          // bit 1
#define ATCC1PPS2               ATCC1PPSbits.ATCC1PPS2          // bit 2
#define ATCC1PPS3               ATCC1PPSbits.ATCC1PPS3          // bit 3
#define ATCC1PPS4               ATCC1PPSbits.ATCC1PPS4          // bit 4

#define ATCC2PPS0               ATCC2PPSbits.ATCC2PPS0          // bit 0
#define ATCC2PPS1               ATCC2PPSbits.ATCC2PPS1          // bit 1
#define ATCC2PPS2               ATCC2PPSbits.ATCC2PPS2          // bit 2
#define ATCC2PPS3               ATCC2PPSbits.ATCC2PPS3          // bit 3
#define ATCC2PPS4               ATCC2PPSbits.ATCC2PPS4          // bit 4

