OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1619.h
#define PID1IN0                 PID1INLbits.PID1IN0             // bit 0, shadows bit in PID1INLbits
#define IN0                     PID1INLbits.IN0                 // bit 0, shadows bit in PID1INLbits
#define PID1IN1                 PID1INLbits.PID1IN1             // bit 1, shadows bit in PID1INLbits
#define IN1                     PID1INLbits.IN1                 // bit 1, shadows bit in PID1INLbits
#define PID1IN2                 PID1INLbits.PID1IN2             // bit 2, shadows bit in PID1INLbits
#define IN2                     PID1INLbits.IN2                 // bit 2, shadows bit in PID1INLbits
#define PID1IN3                 PID1INLbits.PID1IN3             // bit 3, shadows bit in PID1INLbits
#define IN3                     PID1INLbits.IN3                 // bit 3, shadows bit in PID1INLbits
#define PID1IN4                 PID1INLbits.PID1IN4             // bit 4, shadows bit in PID1INLbits
#define IN4                     PID1INLbits.IN4                 // bit 4, shadows bit in PID1INLbits
#define PID1IN5                 PID1INLbits.PID1IN5             // bit 5, shadows bit in PID1INLbits
#define IN5                     PID1INLbits.IN5                 // bit 5, shadows bit in PID1INLbits
#define PID1IN6                 PID1INLbits.PID1IN6             // bit 6, shadows bit in PID1INLbits
#define IN6                     PID1INLbits.IN6                 // bit 6, shadows bit in PID1INLbits
#define PID1IN7                 PID1INLbits.PID1IN7             // bit 7, shadows bit in PID1INLbits
#define IN7                     PID1INLbits.IN7                 // bit 7, shadows bit in PID1INLbits

#define PID1K18                 PID1K1Hbits.PID1K18             // bit 0, shadows bit in PID1K1Hbits
#define K18                     PID1K1Hbits.K18                 // bit 0, shadows bit in PID1K1Hbits
#define PID1K19                 PID1K1Hbits.PID1K19             // bit 1, shadows bit in PID1K1Hbits
#define K19                     PID1K1Hbits.K19                 // bit 1, shadows bit in PID1K1Hbits
#define PID1K110                PID1K1Hbits.PID1K110            // bit 2, shadows bit in PID1K1Hbits
#define K110                    PID1K1Hbits.K110                // bit 2, shadows bit in PID1K1Hbits
#define PID1K111                PID1K1Hbits.PID1K111            // bit 3, shadows bit in PID1K1Hbits
#define K111                    PID1K1Hbits.K111                // bit 3, shadows bit in PID1K1Hbits
#define PID1K112                PID1K1Hbits.PID1K112            // bit 4, shadows bit in PID1K1Hbits
#define K112                    PID1K1Hbits.K112                // bit 4, shadows bit in PID1K1Hbits
#define PID1K113                PID1K1Hbits.PID1K113            // bit 5, shadows bit in PID1K1Hbits
#define K113                    PID1K1Hbits.K113                // bit 5, shadows bit in PID1K1Hbits
#define PID1K114                PID1K1Hbits.PID1K114            // bit 6, shadows bit in PID1K1Hbits
#define K114                    PID1K1Hbits.K114                // bit 6, shadows bit in PID1K1Hbits
#define PID1K115                PID1K1Hbits.PID1K115            // bit 7, shadows bit in PID1K1Hbits
#define K115                    PID1K1Hbits.K115                // bit 7, shadows bit in PID1K1Hbits

#define PID1K10                 PID1K1Lbits.PID1K10             // bit 0, shadows bit in PID1K1Lbits
#define K10                     PID1K1Lbits.K10                 // bit 0, shadows bit in PID1K1Lbits
#define PID1K11                 PID1K1Lbits.PID1K11             // bit 1, shadows bit in PID1K1Lbits
#define K11                     PID1K1Lbits.K11                 // bit 1, shadows bit in PID1K1Lbits
#define PID1K12                 PID1K1Lbits.PID1K12             // bit 2, shadows bit in PID1K1Lbits
#define K12                     PID1K1Lbits.K12                 // bit 2, shadows bit in PID1K1Lbits
#define PID1K13                 PID1K1Lbits.PID1K13             // bit 3, shadows bit in PID1K1Lbits
#define K13                     PID1K1Lbits.K13                 // bit 3, shadows bit in PID1K1Lbits
#define PID1K14                 PID1K1Lbits.PID1K14             // bit 4, shadows bit in PID1K1Lbits
#define K14                     PID1K1Lbits.K14                 // bit 4, shadows bit in PID1K1Lbits
#define PID1K15                 PID1K1Lbits.PID1K15             // bit 5, shadows bit in PID1K1Lbits
#define K15                     PID1K1Lbits.K15                 // bit 5, shadows bit in PID1K1Lbits
#define PID1K16                 PID1K1Lbits.PID1K16             // bit 6, shadows bit in PID1K1Lbits
#define K16                     PID1K1Lbits.K16                 // bit 6, shadows bit in PID1K1Lbits
#define PID1K17                 PID1K1Lbits.PID1K17             // bit 7, shadows bit in PID1K1Lbits
#define K17                     PID1K1Lbits.K17                 // bit 7, shadows bit in PID1K1Lbits

#define PID1K28                 PID1K2Hbits.PID1K28             // bit 0, shadows bit in PID1K2Hbits
#define K28                     PID1K2Hbits.K28                 // bit 0, shadows bit in PID1K2Hbits
#define PID1K29                 PID1K2Hbits.PID1K29             // bit 1, shadows bit in PID1K2Hbits
#define K29                     PID1K2Hbits.K29                 // bit 1, shadows bit in PID1K2Hbits
#define PID1K210                PID1K2Hbits.PID1K210            // bit 2, shadows bit in PID1K2Hbits
#define K210                    PID1K2Hbits.K210                // bit 2, shadows bit in PID1K2Hbits
#define PID1K211                PID1K2Hbits.PID1K211            // bit 3, shadows bit in PID1K2Hbits
#define K211                    PID1K2Hbits.K211                // bit 3, shadows bit in PID1K2Hbits
#define PID1K212                PID1K2Hbits.PID1K212            // bit 4, shadows bit in PID1K2Hbits
#define K212                    PID1K2Hbits.K212                // bit 4, shadows bit in PID1K2Hbits
#define PID1K213                PID1K2Hbits.PID1K213            // bit 5, shadows bit in PID1K2Hbits
#define K213                    PID1K2Hbits.K213                // bit 5, shadows bit in PID1K2Hbits
#define PID1K214                PID1K2Hbits.PID1K214            // bit 6, shadows bit in PID1K2Hbits
#define K214                    PID1K2Hbits.K214                // bit 6, shadows bit in PID1K2Hbits
#define PID1K215                PID1K2Hbits.PID1K215            // bit 7, shadows bit in PID1K2Hbits
#define K215                    PID1K2Hbits.K215                // bit 7, shadows bit in PID1K2Hbits

